content/garden/20240418102810-solving_tough_problems_as_a_team.md
+++
title = "Solving tough problems as a team"
author = ["Darrell Banks"]
draft = true
+++

tags
: [Engineering]({{< relref "../../../../../../Dropbox/darrellbanks.com/org/notes/20230109144724-engineering.md" >}})

While speaking with one of my staff+ colleagues recently, the topic of solving hard problems
with an engineering team came up. There's an ethos amongst high-level engineers that a part
of their job is to go off and solve hard problems in isolation, but that can often lead
to the engineer being the only one on the team who has the context and knowledge to work
in that area of the project.

Is there a way to untangle large problems up front, such that they are approachable by
an engineering team as opposed to a single engineer?


## A good question to ask might be "why is this problem unapproachable by other engineers?" {#a-good-question-to-ask-might-be-why-is-this-problem-unapproachable-by-other-engineers}


### Lack of documentation? {#lack-of-documentation}


### Unclear code paths? {#unclear-code-paths}


### Architectural/system knowledge gaps? {#architectural-system-knowledge-gaps}


### Tribal knowledge? (one man repository) {#tribal-knowledge--one-man-repository}


## What about instead of doing the work, you create a draft PR with guidance? Sort of like a guided choose your own adventure experiment? {#what-about-instead-of-doing-the-work-you-create-a-draft-pr-with-guidance-sort-of-like-a-guided-choose-your-own-adventure-experiment}


### This is kind of like an open source model asking for contributions, but on a single problem set or feature. {#this-is-kind-of-like-an-open-source-model-asking-for-contributions-but-on-a-single-problem-set-or-feature-dot}

avaang
